load.yml
config:
  target: 'https://api.plutomi.com'
  phases:
    # - duration: 60
    #   arrivalRate: 5
    #   rampTo: 25
    #   name: Warm up
    # - duration: 120
    #   arrivalRate: 25
    #   rampTo: 50
    #   name: Ramp up load
    # - duration: 240
    #   arrivalRate: 50
    #   rampTo: 200
    #   name: Sustained load 1

    - duration: 1200
      arrivalRate: 50
      rampTo: 500
      name: Ramp up
    # - duration: 600
    #   arrivalRate: 500
    #   name: Sustained load
    # - duration: 600
    #   arrivalRate: 500
    #   rampTo: 0
    #   name: Ramp down
scenarios:
  - name: 'test'
    flow:
      - get:
          url: '/public/orgs/plutohmi'